package java0706;

public class Array_Ex {

	public static void main(String[] args) {
		//1차원 배열
		int[] num=new int[5];
		//2차원 배열
		int[][] arr=new int[5][5];
		// 행 => 0~4
		int n=1;
		for(int i=0; i<5; i++) {
			for(int j=0;j<5;j++) {
				arr[i][j]=n;
				n++;
			}
		}
		//i=0일때 [0][0] , [0],[1] , [0][2] , [0][3] , [0][4]
		//i=1일때 [1][0] , [1],[1] , [1][2] , [1][3] , [1][4]
		//i=2일때 [2][0] , [2],[1] , [2][2] , [2][3] , [2][4]
		//i=3일때 [3][0] , [3],[1] , [3][2] , [3][3] , [3][4]
		//i=4일때 [4][0] , [4],[1] , [4][2] , [4][3] , [4][4]
		
		for(int i=0; i<5; i++) {
			for(int j=0;j<5;j++) {
				System.out.print(arr[i][j]);
			}
			System.out.println();
		}
	}
/*  마방진ex
 * 1. 첫행의 중앙에서 1이 시작
 * 2. 진행방향 오른쪽으로 1칸,위쪽1칸
 * 3. 행이-1 이 되면 행은 가장 아래행으로
 * 4. 열이 범위를 넘었다(값이 5) j=0
 * 5. 이동후 값이 존재한다면
 * 6. i=1, j=5 => i=i+2; j=j-1;*/
}
